{
  "tutorial": {
    "welcome": "Welcome to Sights, an app designed to help you understand what's around you. To get started, tap anywhere on the screen.",
    "takePhoto": "To take a picture, simply tap once anywhere on the screen. The app will automatically capture and analyze what's in front of you.",
    "autoRead": "When system screen reader is not enabled, the app will automatically read the analysis text. You can tap the screen to stop reading, or use the auto-read toggle to disable this feature.",
    "adjustSpeed": "When auto-read is enabled, you can change the reading speed by sliding your finger up or down on the screen, or by tapping the speed button.",
    "retake": "After viewing results, you can take another picture by either tapping the retake button or double tapping the screen. Let's get started!",
    "step": "Step {{step}} of {{total}}",
    "tapToContinue": "Tap anywhere to continue"
  },
  "camera": {
    "ready": "Camera is ready. Tap anywhere on the screen to take a picture.",
    "denied": "Camera permission was denied. This app requires camera access to function properly.",
    "taking": "Taking picture...",
    "failed": "Failed to take picture. Please try again.",
    "cancelled": "Picture taking was cancelled. Tap again to take a picture.",
    "requestingPermission": "Requesting camera permission...",
    "noAccess": "No access to camera",
    "grantPermission": "Please grant camera permission in settings to use this app.",
    "tapToTake": "Tap anywhere to take a picture",
    "processing": "Processing..."
  },
  "result": {
    "analyzing": "Analyzing image",
    "analyzingHint": "Please wait while we analyze your image. This may take a few seconds.",
    "imageDescription": "Image Description",
    "retake": "Retake",
    "retakeHint": "Double tap to take another picture",
    "doubleTapRetake": "Or double tap anywhere to retake",
    "errorAnalyzing": "Sorry, there was an error analyzing the image. Please try again.",
    "selectSpeed": "Select Speed",
    "speed": "Speed: {{value}}x",
    "paused": "Reading stopped",
    "autoRead": "Auto Read",
    "donate": "Donate"
  },
  "donate": {
    "title": "Support Us",
    "subtitle": "Every 1000 photos, we need to pay about 1 USD, hope you can support this app, thank you!",
    "alipay": "Alipay",
    "alipayHint": "Please scan the QR code to donate",
    "paypal": "PayPal",
    "paypalButton": "Donate to Sights",
    "feedback": "Give Feedback"
  },
  "common": {
    "appName": "Sights"
  }
} 